Revit 2024 API
ParameterTypeId.MaterialParamSmoothness Property
 "Smoothness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId MaterialParamSmoothness { get; }
Visual Basic
Public Shared ReadOnly Property MaterialParamSmoothness As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MaterialParamSmoothness {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace